БИТУправление_медицинским_центром_демо/src/Documents/УведомлениеВладельцаОВвозеЛПвРФБезПодтвержденияМДЛП/УведомлениеВладельцаОВвозеЛПвРФБезПодтвержденияМДЛП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеВладельцаОВвозеЛПвРФБезПодтвержденияМДЛП</name>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеУведомленияВладельцаОВвозеЛПвРФБезПодтвержденияМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОрганизации</name>
    <type>
      <types>DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКонтрагента</name>
    <type>
      <types>DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ОрганизацииМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ОрганизацииМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>DefinedType.GTIN</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НомераУпаковок</name>
    <attributes>
      <name>НомерКИЗ</name>
      <type>
        <types>DefinedType.НомерУпаковкиМДЛП</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПодтверждения</name>
      <type>
        <types>EnumRef.СостоянияПодтвержденияМДЛП</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТранспортныеУпаковки</name>
    <attributes>
      <name>НомерУпаковки</name>
      <type>
        <types>DefinedType.SSCC</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПодтверждения</name>
      <type>
        <types>EnumRef.СостоянияПодтвержденияМДЛП</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/УпаковкиМДЛП/УпаковкиМДЛП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УпаковкиМДЛП</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыУпаковокМДЛП</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.ОрганизацииМДЛП</types>
    </type>
  </resources>
  <resources>
    <name>НомерГрупповойУпаковки</name>
    <type>
      <types>DefinedType.SSCC</types>
    </type>
  </resources>
  <resources>
    <name>ИсходныйСтатус</name>
    <type>
      <types>EnumRef.СтатусыУпаковокМДЛП</types>
    </type>
  </resources>
  <resources>
    <name>ГрупповаяУпаковка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВложеныПотребительскиеУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПредыдущийСтатус</name>
    <type>
      <types>EnumRef.СтатусыУпаковокМДЛП</types>
    </type>
  </resources>
  <resources>
    <name>ИсходнаяЗонаТаможенногоКонтроля</name>
    <type>
      <types>CatalogRef.ЗоныТаможенногоКонтроляМДЛП</types>
    </type>
  </resources>
  <resources>
    <name>ИсходныйДокументРезерва</name>
    <type>
      <types>String</types>
      <types>AnyRef</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерУпаковки</name>
    <type>
      <types>DefinedType.НомерУпаковкиМДЛП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоДеятельности</name>
    <type>
      <types>CatalogRef.ОрганизацииМДЛП</types>
      <types>CatalogRef.МестаДеятельностиМДЛП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРезерва</name>
    <type>
      <types>String</types>
      <types>AnyRef</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаТаможенногоКонтроля</name>
    <type>
      <types>CatalogRef.ЗоныТаможенногоКонтроляМДЛП</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/СостоянияПодтвержденияМДЛП/СостоянияПодтвержденияМДЛП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияПодтвержденияМДЛП</name>
  <enumValues>
    <name>КПередаче</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленоКПередаче</name>
  </enumValues>
  <enumValues>
    <name>Передано</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>Подтвердить</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитьПодготовленоКПередаче</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитьПередано</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитьПринятоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитьОтклоненоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>Подтверждено</name>
  </enumValues>
  <enumValues>
    <name>Отозвать</name>
  </enumValues>
  <enumValues>
    <name>ОтозватьПодготовленоКПередаче</name>
  </enumValues>
  <enumValues>
    <name>ОтозватьПередано</name>
  </enumValues>
  <enumValues>
    <name>ОтозваноПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ОтозватьОтклоненоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>Отказаться</name>
  </enumValues>
  <enumValues>
    <name>ОтказатьсяПодготовленоКПередаче</name>
  </enumValues>
  <enumValues>
    <name>ОтказатьсяПередано</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоПокупателем</name>
  </enumValues>
  <enumValues>
    <name>ОтказатьсяОтклоненоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>АктуализироватьДанныеОбУпаковках</name>
  </enumValues>
  <enumValues>
    <name>ДанныеОбУпаковкахАктуализированы</name>
  </enumValues>
  <enumValues>
    <name>ОприходованоНовымВладельцем</name>
  </enumValues>
  <enumValues>
    <name>ВвезеноВРФБезПодтверждения</name>
  </enumValues>
  <enumValues>
    <name>ПереданоЧастично</name>
  </enumValues>
  <enumValues>
    <name>ПринятоЧастично</name>
  </enumValues>
  <enumValues>
    <name>ПринятоСОтклонениемОтТребований</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>ОформитьУведомления</name>
  </enumValues>
  <enumValues>
    <name>ОформитьИнвентаризацию</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/УведомлениеВладельцаОВвозеЛПвРФБезПодтвержденияМДЛП/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнтеграцияМДЛППереопределяемый.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ВызватьИсключение НСтр("ru = 'Уведомление владельца о ввозе ЛП в РФ без подтверждения грузоотправителя поддерживает только загрузку. Создание нового документа недоступно.'");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если Не ИнтеграцияМДЛП.ИспользоватьХарактеристикиНоменклатуры() Тогда
		НепроверяемыеРеквизиты.Добавить("Товары.Характеристика");
	КонецЕсли;
	
	Если Не ИнтеграцияМДЛП.ИспользоватьСерииНоменклатуры() Тогда
		НепроверяемыеРеквизиты.Добавить("Товары.Серия");
	КонецЕсли;
	
	ИнтеграцияМДЛППереопределяемый.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	ИнтеграцияМДЛП.ПроверитьВозможностьЗаписиУведомления(ЭтотОбъект, РежимЗаписи);
	
	ИнтеграцияМДЛППереопределяемый.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияМДЛП.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СтандартнаяОбработка = Истина;
	ИнтеграцияМДЛППереопределяемый.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	НомераУпаковок.НомерКиЗ  КАК НомерУпаковки
	|ПОМЕСТИТЬ ПодтвержденныеУпаковки
	|ИЗ
	|	Документ.УведомлениеВладельцаОВвозеЛПвРФБезПодтвержденияМДЛП.НомераУпаковок КАК НомераУпаковок
	|ГДЕ
	|	НомераУпаковок.Ссылка = &Ссылка
	|	И НомераУпаковок.СостояниеПодтверждения В (
	|		ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ВвезеноВРФБезПодтверждения))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НомераУпаковок.НомерУпаковки  КАК НомерУпаковки
	|ИЗ
	|	Документ.УведомлениеВладельцаОВвозеЛПвРФБезПодтвержденияМДЛП.ТранспортныеУпаковки КАК НомераУпаковок
	|ГДЕ
	|	НомераУпаковок.Ссылка = &Ссылка
	|	И НомераУпаковок.СостояниеПодтверждения В (
	|		ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ВвезеноВРФБезПодтверждения))
	|");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МестоДеятельности", Организация);
	Запрос.УстановитьПараметр("ПустаяГрупповаяУпаковка", Метаданные.ОпределяемыеТипы.SSCC.Тип.ПривестиЗначение());
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	ИнтеграцияМДЛП.ДобавитьКлючиУпаковок(Запрос.МенеджерВременныхТаблиц, "ПодтвержденныеУпаковки");
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеУпаковок.НомерУпаковки           КАК НомерУпаковки,
	|	ДанныеУпаковок.КлючУпаковки            КАК КлючУпаковки,
	|	ДанныеУпаковок.МестоДеятельности       КАК МестоДеятельности,
	|	ДанныеУпаковок.НомерГрупповойУпаковки  КАК НомерГрупповойУпаковки,
	|	ДанныеУпаковок.ДокументРезерва         КАК ДокументРезерва,
	|	ДанныеУпаковок.ГрупповаяУпаковка       КАК ГрупповаяУпаковка
	|ПОМЕСТИТЬ ДанныеУпаковок
	|ИЗ
	|	РегистрСведений.УпаковкиМДЛП КАК ДанныеУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ПодтвержденныеУпаковки КАК ПодтвержденныеУпаковки
	|		ПО
	|			ПодтвержденныеУпаковки.НомерУпаковки = ДанныеУпаковок.НомерУпаковки
	|			И ПодтвержденныеУпаковки.КлючУпаковки = ДанныеУпаковок.КлючУпаковки
	|			И ДанныеУпаковок.МестоДеятельности = &МестоДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Родительские упаковки самого верхнего уровня. Необходимы в случае если в 702 было использовано автоизъятие.
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РодительскиеУпаковкиСамогоВерхнегоУровня.НомерУпаковки      КАК НомерУпаковки,
	|	РодительскиеУпаковкиСамогоВерхнегоУровня.КлючУпаковки       КАК КлючУпаковки,
	|	РодительскиеУпаковкиСамогоВерхнегоУровня.МестоДеятельности  КАК МестоДеятельности
	|ПОМЕСТИТЬ РодительскиеУпаковкиСамогоВерхнегоУровня
	|ИЗ
	|	ДанныеУпаковок КАК ДанныеУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			РегистрСведений.УпаковкиМДЛП КАК РодительскиеУпаковкиСамогоВерхнегоУровня
	|		ПО
	|			РодительскиеУпаковкиСамогоВерхнегоУровня.НомерУпаковки = ДанныеУпаковок.ДокументРезерва
	|			И РодительскиеУпаковкиСамогоВерхнегоУровня.МестоДеятельности = &МестоДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Родительские упаковки самого верхнего уровня.
	|ВЫБРАТЬ
	|	РодительскиеУпаковкиСамогоВерхнегоУровня.НомерУпаковки      КАК НомерУпаковки,
	|	РодительскиеУпаковкиСамогоВерхнегоУровня.КлючУпаковки       КАК КлючУпаковки,
	|	РодительскиеУпаковкиСамогоВерхнегоУровня.МестоДеятельности  КАК МестоДеятельности,
	|	ЛОЖЬ                                                        КАК КСписанию
	|ИЗ
	|	РодительскиеУпаковкиСамогоВерхнегоУровня КАК РодительскиеУпаковкиСамогоВерхнегоУровня
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Вложенные упаковки.
	|ВЫБРАТЬ
	|	ВложенныеУпаковки.НомерУпаковки            КАК НомерУпаковки,
	|	ВложенныеУпаковки.КлючУпаковки             КАК КлючУпаковки,
	|	ВложенныеУпаковки.МестоДеятельности        КАК МестоДеятельности,
	|	ВложенныеУпаковки.НомерГрупповойУпаковки   КАК НомерГрупповойУпаковки,
	|	ВложенныеУпаковки.ДокументРезерва          КАК ДокументРезерва,
	|	ВложенныеУпаковки.ГрупповаяУпаковка        КАК ГрупповаяУпаковка,
	|	НЕ ДанныеУпаковок.НомерУпаковки ЕСТЬ NULL  КАК КСписанию
	|ИЗ
	|	РодительскиеУпаковкиСамогоВерхнегоУровня КАК РодительскиеУпаковкиСамогоВерхнегоУровня
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			РегистрСведений.УпаковкиМДЛП КАК ВложенныеУпаковки
	|				ЛЕВОЕ СОЕДИНЕНИЕ
	|					ДанныеУпаковок КАК ДанныеУпаковок
	|				ПО
	|					ДанныеУпаковок.НомерУпаковки = ВложенныеУпаковки.НомерУпаковки
	|					И ДанныеУпаковок.КлючУпаковки = ВложенныеУпаковки.КлючУпаковки
	|		ПО
	|			ВложенныеУпаковки.ДокументРезерва = РодительскиеУпаковкиСамогоВерхнегоУровня.НомерУпаковки
	|			И ВложенныеУпаковки.МестоДеятельности = &МестоДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Упаковки без родителей: потребительские упаковки или групповые упаковки самого верхнего уровня, у которых все вложенные упаковки можно списать без проверки.
	|ВЫБРАТЬ
	|	ДанныеУпаковок.НомерУпаковки      КАК НомерУпаковки,
	|	ДанныеУпаковок.КлючУпаковки       КАК КлючУпаковки,
	|	ДанныеУпаковок.МестоДеятельности  КАК МестоДеятельности,
	|	ДанныеУпаковок.ГрупповаяУпаковка  КАК ГрупповаяУпаковка
	|ИЗ
	|	ДанныеУпаковок КАК ДанныеУпаковок
	|ГДЕ
	|	ДанныеУпаковок.НомерГрупповойУпаковки = &ПустаяГрупповаяУпаковка
	|";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОтразитьСписание = Результат[Результат.ВГраница()].Выбрать();
	Пока ОтразитьСписание.Следующий() Цикл
		Если ОтразитьСписание.ГрупповаяУпаковка Тогда
			УдалитьУпаковки = РегистрыСведений.УпаковкиМДЛП.СоздатьНаборЗаписей();
			УдалитьУпаковки.Отбор.ДокументРезерва.Установить(ОтразитьСписание.НомерУпаковки);
			УдалитьУпаковки.Отбор.МестоДеятельности.Установить(ОтразитьСписание.МестоДеятельности);
			УдалитьУпаковки.Записать();
		КонецЕсли;
		ОтразитьСписание(ОтразитьСписание);
	КонецЦикла;
	
	ДанныеРодителей = Результат[Результат.ВГраница() - 2].Выгрузить();
	ДанныеВложенных = Результат[Результат.ВГраница() - 1].Выгрузить();
	
	Для Каждого СтрокаРодителя Из ДанныеРодителей Цикл
		ОтразитьСписаниеРекурсивно(СтрокаРодителя, ДанныеВложенных);
		Если СтрокаРодителя.КСписанию Тогда
			ОтразитьСписание(СтрокаРодителя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	СтандартнаяОбработка = Истина;
	ИнтеграцияМДЛППереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияМДЛП.ОтменитьРезерв(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтразитьСписаниеРекурсивно(СтрокаРодителя, ДанныеВложенных)
	
	КСписанию = Истина;
	
	НайденныеВложенные = ДанныеВложенных.НайтиСтроки(Новый Структура("НомерГрупповойУпаковки", СтрокаРодителя.НомерУпаковки));
	Для Каждого СтрокаВложенного Из НайденныеВложенные Цикл
		
		Если СтрокаРодителя.КСписанию Тогда
			СтрокаВложенного.КСписанию = Истина;
		КонецЕсли;
		
		Если СтрокаВложенного.ГрупповаяУпаковка Тогда
			ОтразитьСписаниеРекурсивно(СтрокаВложенного, ДанныеВложенных);
			Если СтрокаВложенного.КСписанию Тогда
				ОтразитьСписание(СтрокаВложенного);
			КонецЕсли;
		Иначе
			Если СтрокаВложенного.КСписанию Тогда
				ОтразитьСписание(СтрокаВложенного);
			КонецЕсли;
		КонецЕсли;
		
		КСписанию = КСписанию И СтрокаВложенного.КСписанию;
		
	КонецЦикла;
	
	СтрокаРодителя.КСписанию = КСписанию;
	
КонецПроцедуры

Процедура ОтразитьСписание(Данные)
	
	УдалитьУпаковки = РегистрыСведений.УпаковкиМДЛП.СоздатьНаборЗаписей();
	УдалитьУпаковки.Отбор.НомерУпаковки.Установить(Данные.НомерУпаковки);
	УдалитьУпаковки.Отбор.КлючУпаковки.Установить(Данные.КлючУпаковки);
	УдалитьУпаковки.Отбор.МестоДеятельности.Установить(Данные.МестоДеятельности);
	УдалитьУпаковки.Записать();
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
